Revit 2024 API
SystemsAnalysisReportStyle Enumeration
 The report style of systems analysis.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public enum SystemsAnalysisReportStyle
Visual Basic
Public Enumeration SystemsAnalysisReportStyle
Visual C++
public enum class SystemsAnalysisReportStyle
Members
Member name | Description
Detailed |  The detailed report style.
Loads |  The loads report style.
See Also
Autodesk.Revit.DB.Analysis Namespace